app/controllers/events_controller.rb

SELECT "events".* FROM "events"
---
  def index
    #displays all the events
    @events = Event.all