app/controllers/users_controller.rb

  def show
    @event = Event.new
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 2  ORDER BY "users"."id" ASC LIMIT 1